experiments/2_vllm_0.19_Qwen3-8B/3_direct_vllm_serve/out.log
====== Terminal 1 ======
[25 Jun 2026] ~/Workspaces/tokenkaki/deploy/vllm ❯ VLLM_HOST=172.17.0.1 CUDA_DEVICE_ORDER=PCI_BUS_ID CUDA_VISIBLE_DEVICES=4 UV_TORCH_BACKEND=auto ./run-openai-server.sh

====== Terminal 2 ======
[25 Jun 2026] ~/Workspaces/tokenkaki ❯ BENCHMARK_TARGET=vllm VLLM_BASE_URL=http://172.17.0.1:8001 EXPERIMENT_ROOT=experiments/2_vllm_0.19_Qwen3-8B NUM_PROMPTS=100 REQUEST_RATE=5 RANDOM_INPUT_LEN=128 RANDOM_OUTPUT_LEN=64 RESULT_FILENAME=vllm-direct-serving-qwen3-8b-a100.json ./benchmarks/vllm-serving-bench.sh
Running vLLM serving benchmark
  target: vllm
  benchmark path: direct_vllm
  base URL: http://172.17.0.1:8001
  served model name: Qwen/Qwen3-8B
  public model: qwen3-8b
  backend model: Qwen/Qwen3-8B
  tokenizer model: Qwen/Qwen3-8B
  experiment root: /home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B
  num prompts: 100
  request rate: 5
  random input/output tokens: 128/64
  uv torch backend: auto
  result: /home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B/3_direct_vllm_serve/vllm-direct-serving-qwen3-8b-a100.json
WARNING 06-25 15:14:32 [cuda.py:618] Detected different devices in the system: NVIDIA A100-SXM4-40GB, NVIDIA A100-SXM4-40GB, NVIDIA A100-SXM4-40GB, NVIDIA DGX Display, NVIDIA A100-SXM4-40GB. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f802afb49a0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://172.17.0.1:8001', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['benchmark_target=vllm', 'benchmark_path=direct_vllm', 'base_url=http://172.17.0.1:8001', 'gateway_base_url=http://127.0.0.1:8000', 'vllm_base_url=http://172.17.0.1:8001', 'public_model=qwen3-8b', 'backend_model=Qwen/Qwen3-8B', 'served_model_name=Qwen/Qwen3-8B', 'tokenizer_model=Qwen/Qwen3-8B', 'experiment_root=/home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B', 'uv_torch_backend=auto', 'benchmark_runner=same-host'], result_dir='/home/darius/Workspaces/tokenkaki/experiments/2_vllm_0.19_Qwen3-8B/3_direct_vllm_serve', result_filename='vllm-direct-serving-qwen3-8b-a100.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-865cf1cd-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='Qwen/Qwen3-8B', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 06-25 15:14:40 [datasets.py:700] Sampling input_len from [128, 128] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:20<00:00,  4.79it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  20.89     
Total input tokens:                      12800     
Total generated tokens:                  6400      
Request throughput (req/s):              4.79      
Output token throughput (tok/s):         306.40    
Peak output token throughput (tok/s):    649.00    
Peak concurrent requests:                17.00     
Total token throughput (tok/s):          919.19    
---------------Time to First Token----------------
Mean TTFT (ms):                          50.08     
Median TTFT (ms):                        48.10     
P99 TTFT (ms):                           80.02     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.73     
Median TPOT (ms):                        13.69     
P99 TPOT (ms):                           14.47     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.52     
Median ITL (ms):                         13.22     
P99 ITL (ms):                            20.85     
==================================================